Revit 2024 API
RebarShapeConstraintSagittaLength Members
The RebarShapeConstraintSagittaLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintSagittaLength
 Create a constraint to drive sagitta length.
Methods
Name | Description
Dispose |  (Inherited from RebarShapeConstraint.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetParamId
 Return the Id of the parameter associated with this constraint.
 (Inherited from RebarShapeConstraint.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RebarShapeConstraint.)
See Also
RebarShapeConstraintSagittaLength Class
Autodesk.Revit.DB.Structure Namespace